In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

%matplotlib inline

In [2]:
name_bmi = "bmi_mundial_wikipedia.xlsx"

In [3]:
name_pib = "pib_mundial.xls"

In [4]:
name_poblacion = "poblacion_mundial.xls"

In [5]:
path_to_zips = "/home/dsc/Desktop/TFM/DATA/"

In [6]:
#limpieza de fichero de bmi_mundial_wikipedia

In [7]:
dataset_bmi = path_to_zips + name_bmi

In [8]:
df_bmi = pd.read_excel(dataset_bmi)

In [9]:
df_bmi.head()

        Country Overall Overall mean Female  Female mean Male     Male mean
0           NaN    rank  BMI (kg/m2)   rank  BMI (kg/m2)  rank  BMI (kg/m2)
1         Nepal       1         32.5      3         32.8     1         32.1
2   Switzerland       2         31.9      1         33.5     2         30.4
3  Vatican City       3         31.7      1         33.5     3         29.9
4   Afghanistan       4           30      6         30.8     4         29.5

In [10]:
df_bmi.tail()

       Country Overall Overall mean Female Female mean Male  Male mean
191  Venezuela       -            -      -           -     -         -
192    Vietnam       -            -      -           -     -         -
193      Yemen       -            -      -           -     -         -
194     Zambia       -            -      -           -     -         -
195   Zimbabwe       -            -      -           -     -         -

In [11]:
df_bmi.shape

(196, 7)

In [12]:
df_bmi.columns.tolist()

['Country',
 'Overall',
 'Overall mean',
 'Female',
 'Female mean',
 'Male\xa0',
 'Male mean']

In [13]:
bmi = df_bmi.filter(items=["Country", "Male mean", "Female mean"])

In [14]:
bmi.head()

        Country    Male mean  Female mean
0           NaN  BMI (kg/m2)  BMI (kg/m2)
1         Nepal         32.1         32.8
2   Switzerland         30.4         33.5
3  Vatican City         29.9         33.5
4   Afghanistan         29.5         30.8

In [15]:
bmi_mundial = bmi.drop(bmi.index[0])

In [16]:
bmi_mundial.head()

        Country Male mean Female mean
1         Nepal      32.1        32.8
2   Switzerland      30.4        33.5
3  Vatican City      29.9        33.5
4   Afghanistan      29.5        30.8
5       Albania      28.4        30.9

In [17]:
bmi_mundial.shape

(195, 3)

In [18]:
#limpieza de fichero de pib_mundial

In [19]:
dataset_pib = path_to_zips + name_pib

In [20]:
prueba_df_pib = pd.read_excel(dataset_pib, skiprows =1)

In [21]:
prueba_df_pib.head(10)

  Unnamed: 0 Unnamed: 1  Unnamed: 2      Unnamed: 3    Unnamed: 4 Unnamed: 5
0        NaN        NaN         NaN             NaN  (millions of        NaN
1        NaN    Ranking         NaN         Economy   US dollars)        NaN
2        NaN        NaN         NaN             NaN           NaN        NaN
3        USA          1         NaN   United States      19390604        NaN
4        CHN          2         NaN           China   1.22377e+07        NaN
5        JPN          3         NaN           Japan   4.87214e+06        NaN
6        DEU          4         NaN         Germany   3.67744e+06        NaN
7        GBR          5         NaN  United Kingdom   2.62243e+06        NaN
8        IND          6         NaN           India   2.59749e+06        NaN
9        FRA          7         NaN          France    2.5825e+06        NaN

In [22]:
prueba_df_pib.tail(40)

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5
202,TUV,200,NaN,Tuvalu,39.7313,NaN
203,NaN,NaN,NaN,NaN,NaN,NaN
204,ABW,NaN,NaN,Aruba,..,NaN
205,BMU,NaN,NaN,Bermuda,..,NaN
206,VGB,NaN,NaN,British Virgin Islands,..,NaN
207,CYM,NaN,NaN,Cayman Islands,..,NaN
208,CHI,NaN,NaN,Channel Islands,..,NaN
209,CUW,NaN,NaN,Curaçao,..,NaN
210,ERI,NaN,NaN,Eritrea,..,NaN
211,PYF,NaN,NaN,French Polynesia,..,NaN
212,GIB,NaN,NaN,Gibraltar,..,NaN
213,PRK,NaN,NaN,"Korea, Dem. People's Rep.",..,NaN
214,MCO,NaN,NaN,Monaco,..,NaN
215,NCL,NaN,NaN,New Caledonia,..,NaN
216,SXM,NaN,NaN,Sint Maarten (Dutch part),..,NaN
217,MAF,NaN,NaN,St. Martin (French part),..,NaN
218,SYR,NaN,NaN,Syrian Arab Republic,..,NaN
219,TCA,NaN,NaN,Turks and Caicos Islands,..,NaN
220,VEN,NaN,NaN,"Venezuela, RB",..,NaN
221,NaN,NaN,NaN,NaN,NaN,NaN
222,WLD,NaN,NaN,World,8.06838e+07,NaN
223,NaN,NaN,NaN,NaN,NaN,NaN
224,EAS,NaN,NaN,East Asia & Pacific,2.39993e+07,NaN
225,ECS,NaN,NaN,Europe & Central Asia,2.14385e+07,NaN
226,LCN,NaN,NaN,Latin America & Caribbean,5.95467e+06,NaN
227,MEA,NaN,NaN,Middle East & North Africa,3.26575e+06,NaN
228,NAC,NaN,NaN,North America,2.105e+07,NaN
229,SAS,NaN,NaN,South Asia,3.29174e+06,NaN
230,SSF,NaN,NaN,Sub-Saharan Africa,1.64871e+06,NaN
231,LIC,NaN,NaN,Low income,549654,NaN
232,LMC,NaN,NaN,Lower middle income,6.50416e+06,NaN
233,UMC,NaN,NaN,Upper middle income,2.21684e+07,NaN
234,HIC,NaN,NaN,High income,5.14754e+07,NaN
235,NaN,NaN,NaN,NaN,NaN,NaN
236,NaN,.. Not available.,NaN,NaN,NaN,NaN
237,NaN,Note: Rankings include all World Bank Atlas ec...,NaN,NaN,NaN,NaN
238,NaN,Figures in italics are for 2016 or 2015; ranki...,NaN,NaN,NaN,NaN
239,NaN,a. Based on data from official statistics of U...,NaN,NaN,NaN,NaN
240,NaN,GDP data source: http://data.worldbank.org/dat...,NaN,NaN,NaN,NaN
241,NaN,GDP projections: http://data.worldbank.org/da...,NaN,NaN,NaN,NaN

In [23]:
df_pib = pd.read_excel(dataset_pib, skiprows =4,skipfooter=39)

In [24]:
df_pib.head()

  Unnamed: 0  Unnamed: 1  Unnamed: 2      Unnamed: 3    Unnamed: 4 Unnamed: 5
0        USA           1         NaN   United States  1.939060e+07        NaN
1        CHN           2         NaN           China  1.223770e+07        NaN
2        JPN           3         NaN           Japan  4.872137e+06        NaN
3        DEU           4         NaN         Germany  3.677439e+06        NaN
4        GBR           5         NaN  United Kingdom  2.622434e+06        NaN

In [25]:
df_pib.tail()

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5
195,PLW,196,NaN,Palau,291.544300,NaN
196,MHL,197,NaN,Marshall Islands,199.399247,NaN
197,KIR,198,NaN,Kiribati,196.150061,NaN
198,NRU,199,NaN,Nauru,113.884908,NaN
199,TUV,200,NaN,Tuvalu,39.731317,NaN

In [26]:
df_pib.columns.tolist()

['Unnamed: 0',
 'Unnamed: 1',
 'Unnamed: 2',
 'Unnamed: 3',
 'Unnamed: 4',
 'Unnamed: 5']

In [27]:
df_pib_rename= df_pib.rename(columns={"Unnamed: 3" : "Country", "Unnamed: 4": "Million Dolar"} )

In [28]:
df_pib_rename.columns.tolist()

['Unnamed: 0',
 'Unnamed: 1',
 'Unnamed: 2',
 'Country',
 'Million Dolar',
 'Unnamed: 5']

In [29]:
pib_mundial = df_pib_rename.filter(items=["Country","Million Dolar"])

In [30]:
pib_mundial.head()

          Country  Million Dolar
0   United States   1.939060e+07
1           China   1.223770e+07
2           Japan   4.872137e+06
3         Germany   3.677439e+06
4  United Kingdom   2.622434e+06

In [31]:
#limpieza de fichero de poblacion_mundial

In [32]:
dataset_poblacion = path_to_zips + name_poblacion

In [33]:
prueba_df_poblacion= pd.read_excel(dataset_poblacion, skiprows =1)

In [34]:
prueba_df_poblacion.head(10)

  Unnamed: 0 Unnamed: 1  Unnamed: 2     Unnamed: 3   Unnamed: 4 Unnamed: 5
0        NaN        NaN         NaN            NaN          NaN        NaN
1        NaN    Ranking         NaN        Economy  (thousands)        NaN
2        NaN        NaN         NaN            NaN          NaN        NaN
3        CHN          1         NaN          China      1386395        NaN
4        IND          2         NaN          India      1339180        NaN
5        USA          3         NaN  United States       325719        NaN
6        IDN          4         NaN      Indonesia       263991        NaN
7        BRA          5         NaN         Brazil       209288        NaN
8        PAK          6         NaN       Pakistan       197016        NaN
9        NGA          7         NaN        Nigeria       190886        NaN

In [35]:
prueba_df_poblacion.tail(22)

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5
217,NRU,215,NaN,Nauru,14,NaN
218,TUV,216,NaN,Tuvalu,11,NaN
219,NaN,NaN,NaN,NaN,NaN,NaN
220,ERI,NaN,NaN,Eritrea,..,NaN
221,NaN,NaN,NaN,NaN,NaN,NaN
222,WLD,NaN,NaN,World,7530360,NaN
223,NaN,NaN,NaN,NaN,NaN,NaN
224,EAS,NaN,NaN,East Asia & Pacific,2314365,NaN
225,ECS,NaN,NaN,Europe & Central Asia,915546,NaN
226,LCN,NaN,NaN,Latin America & Caribbean,644138,NaN
227,MEA,NaN,NaN,Middle East & North Africa,444322,NaN
228,NAC,NaN,NaN,North America,362493,NaN
229,SAS,NaN,NaN,South Asia,1788389,NaN
230,SSF,NaN,NaN,Sub-Saharan Africa,1061108,NaN
231,LIC,NaN,NaN,Low income,732449,NaN
232,LMC,NaN,NaN,Lower middle income,2972643,NaN
233,UMC,NaN,NaN,Upper middle income,2576203,NaN
234,HIC,NaN,NaN,High income,1249066,NaN
235,NaN,NaN,NaN,NaN,NaN,NaN
236,NaN,a. Excludes Abkhazia and South Ossetia. b. Ex...,NaN,NaN,NaN,NaN
237,NaN,NaN,NaN,NaN,NaN,NaN
238,NaN,http://data.worldbank.org/data-catalog/world-d...,NaN,NaN,NaN,NaN

In [36]:
df_poblacion = pd.read_excel(dataset_poblacion, skiprows=4, skipfooter=20)

In [37]:
df_poblacion.head()

  Unnamed: 0  Unnamed: 1  Unnamed: 2     Unnamed: 3  Unnamed: 4 Unnamed: 5
0        CHN           1         NaN          China     1386395        NaN
1        IND           2         NaN          India     1339180        NaN
2        USA           3         NaN  United States      325719        NaN
3        IDN           4         NaN      Indonesia      263991        NaN
4        BRA           5         NaN         Brazil      209288        NaN

In [38]:
df_poblacion.tail()

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5
211,MAF,212,NaN,St. Martin (French part),32,NaN
212,VGB,213,NaN,British Virgin Islands,31,NaN
213,PLW,214,NaN,Palau,22,NaN
214,NRU,215,NaN,Nauru,14,NaN
215,TUV,216,NaN,Tuvalu,11,NaN

In [39]:
df_poblacion.columns.tolist()

['Unnamed: 0',
 'Unnamed: 1',
 'Unnamed: 2',
 'Unnamed: 3',
 'Unnamed: 4',
 'Unnamed: 5']

In [45]:
df_poblacion_rename= df_poblacion.rename(columns={"Unnamed: 3" : "Country", "Unnamed: 4": "Poblacion entre 1000"} )

In [46]:
df_poblacion_rename.loc[:, "Poblacion"]= df_poblacion_rename["Poblacion entre 1000"].map(lambda x: x*1000)

In [47]:
df_poblacion_rename.head()

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Country,Poblacion entre 1000,Unnamed: 5,Poblacion
0,CHN,1,NaN,China,1386395,NaN,1386395000
1,IND,2,NaN,India,1339180,NaN,1339180000
2,USA,3,NaN,United States,325719,NaN,325719000
3,IDN,4,NaN,Indonesia,263991,NaN,263991000
4,BRA,5,NaN,Brazil,209288,NaN,209288000

In [48]:
poblacion_mundial = df_poblacion_rename.filter(items=["Country","Poblacion"])

In [50]:
poblacion_mundial.head()

         Country   Poblacion
0          China  1386395000
1          India  1339180000
2  United States   325719000
3      Indonesia   263991000
4         Brazil   209288000

In [51]:
poblacion_mundial.shape

(216, 2)

In [52]:
##unificar en una sola tabla

In [53]:
union1 = poblacion_mundial.merge(pib_mundial, left_on ="Country", right_on="Country")

In [54]:
union1.head()

         Country   Poblacion  Million Dolar
0          China  1386395000   1.223770e+07
1          India  1339180000   2.597491e+06
2  United States   325719000   1.939060e+07
3      Indonesia   263991000   1.015539e+06
4         Brazil   209288000   2.055506e+06

In [55]:
union1.shape

(200, 3)

In [56]:
union2 = union1.merge(bmi_mundial, left_on="Country", right_on="Country")

In [57]:
union2.head()

         Country   Poblacion  Million Dolar Male mean Female mean
0          China  1386395000   1.223770e+07      25.5        29.2
1          India  1339180000   2.597491e+06        27        25.6
2  United States   325719000   1.939060e+07      20.4        21.3
3      Indonesia   263991000   1.015539e+06      26.3        26.2
4         Brazil   209288000   2.055506e+06      27.2        28.8

In [58]:
union2.shape

(172, 5)

In [59]:
#hemos perdido algunos paises ya que son de fuenes diferentes y algunos paises cambian el nombre

In [60]:
union2.isnull().sum()

Country          0
Poblacion        0
Million Dolar    0
Male mean        0
Female mean      0
dtype: int64

In [69]:
union2.columns.tolist()

['Country', 'Poblacion', 'Million Dolar', 'Male mean', 'Female mean']

In [72]:
union2_rename = union2.rename(columns={"Male mean":"Male","Female mean":"Female"})

In [73]:
union2_rename.columns.tolist()

['Country', 'Poblacion', 'Million Dolar', 'Male', 'Female']

In [74]:
union2_rename.loc[:, "BMI medio"]=(0)

In [75]:
union2_rename.head()

         Country   Poblacion  Million Dolar  Male Female  BMI medio
0          China  1386395000   1.223770e+07  25.5   29.2          0
1          India  1339180000   2.597491e+06    27   25.6          0
2  United States   325719000   1.939060e+07  20.4   21.3          0
3      Indonesia   263991000   1.015539e+06  26.3   26.2          0
4         Brazil   209288000   2.055506e+06  27.2   28.8          0

In [76]:
union2_rename.dtypes

Country           object
Poblacion          int64
Million Dolar    float64
Male              object
Female            object
BMI medio          int64
dtype: object

In [77]:
union2_rename["Male"]= union2_rename.Male.convert_objects(convert_numeric=True)

/home/dsc/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:1: FutureWarning: convert_objects is deprecated.  To re-infer data dtypes for object columns, use Series.infer_objects()
For all other conversions use the data-type specific converters pd.to_datetime, pd.to_timedelta and pd.to_numeric.
  """Entry point for launching an IPython kernel.

In [78]:
union2_rename["Female"]= union2_rename.Female.convert_objects(convert_numeric=True)

/home/dsc/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:1: FutureWarning: convert_objects is deprecated.  To re-infer data dtypes for object columns, use Series.infer_objects()
For all other conversions use the data-type specific converters pd.to_datetime, pd.to_timedelta and pd.to_numeric.
  """Entry point for launching an IPython kernel.

In [79]:
union2_rename.dtypes

Country           object
Poblacion          int64
Million Dolar    float64
Male             float64
Female           float64
BMI medio          int64
dtype: object

In [80]:
union2_rename["BMI medio"] = (union2_rename["Male"] + union2_rename["Female"])/2
union2_rename.head()

         Country   Poblacion  Million Dolar  Male  Female  BMI medio
0          China  1386395000   1.223770e+07  25.5    29.2      27.35
1          India  1339180000   2.597491e+06  27.0    25.6      26.30
2  United States   325719000   1.939060e+07  20.4    21.3      20.85
3      Indonesia   263991000   1.015539e+06  26.3    26.2      26.25
4         Brazil   209288000   2.055506e+06  27.2    28.8      28.00

In [81]:
#para poderlo comparar mas jsutamente voy a crear una columna
# pib del pais por habitante

In [82]:
union2_rename.loc[:, "pib/poblacion"] = 0
union2_rename.head()

,Country,Poblacion,Million Dolar,Male,Female,BMI medio,pib/poblacion
0,China,1386395000,1.223770e+07,25.5,29.2,27.35,0
1,India,1339180000,2.597491e+06,27.0,25.6,26.30,0
2,United States,325719000,1.939060e+07,20.4,21.3,20.85,0
3,Indonesia,263991000,1.015539e+06,26.3,26.2,26.25,0
4,Brazil,209288000,2.055506e+06,27.2,28.8,28.00,0

In [83]:
union2_rename["pib/poblacion"] = union2_rename["Million Dolar"]/union2_rename["Poblacion"]

In [84]:
union2_rename.head()

,Country,Poblacion,Million Dolar,Male,Female,BMI medio,pib/poblacion
0,China,1386395000,1.223770e+07,25.5,29.2,27.35,0.008827
1,India,1339180000,2.597491e+06,27.0,25.6,26.30,0.001940
2,United States,325719000,1.939060e+07,20.4,21.3,20.85,0.059532
3,Indonesia,263991000,1.015539e+06,26.3,26.2,26.25,0.003847
4,Brazil,209288000,2.055506e+06,27.2,28.8,28.00,0.009821

In [85]:
pib_bmi = union2_rename

In [86]:
pib_bmi.head()

,Country,Poblacion,Million Dolar,Male,Female,BMI medio,pib/poblacion
0,China,1386395000,1.223770e+07,25.5,29.2,27.35,0.008827
1,India,1339180000,2.597491e+06,27.0,25.6,26.30,0.001940
2,United States,325719000,1.939060e+07,20.4,21.3,20.85,0.059532
3,Indonesia,263991000,1.015539e+06,26.3,26.2,26.25,0.003847
4,Brazil,209288000,2.055506e+06,27.2,28.8,28.00,0.009821